notes/01Introduction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1 Introduction</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Oishe Farhan" />
<h1 class="titleTOP"> <a href="../index.html">Machine Learning</a></h1>
<link rel="stylesheet" type="text/css" href="../css/style1.css" />
</head>
<body>
<div id="content">
<h1 class="title">1 Introduction</h1>
<div id="outline-container-orge54120d" class="outline-2">
<h2 id="orge54120d"><span class="section-number-2">1</span> What is Machine Learning?</h2>
<div class="outline-text-2" id="text-1">
<p>
A computer program is said to learn from experience E with respect to some class of tasks T and performance measure P, if its performance at tasks in T, as measured by P, improves with experience E.<br />
</p>
\begin{align*}
\text{P} &= \text{Performance} \\
\text{T} &= \text{Tasks} \\
\text{E} &= \text{Experiance} \\
&P(T) \propto E
\end{align*}
</div>
</div>
<div id="outline-container-org1568e1a" class="outline-2">
<h2 id="org1568e1a"><span class="section-number-2">2</span> Types of Learning</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgde6bc34" class="outline-3">
<h3 id="orgde6bc34"><span class="section-number-3">2.1</span> Supervised Learning</h3>
<div class="outline-text-3" id="text-2-1">
<p>
There is a given data set where the correct output is known. It is a matter of finding the relationship between the input and the output.<br />
</p>
</div>
<div id="outline-container-org243f058" class="outline-4">
<h4 id="org243f058"><span class="section-number-4">2.1.1</span> Regression</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>Predicting results with continous output<br /></li>
<li>Map input variables to a continous function<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org2821b9b" class="outline-4">
<h4 id="org2821b9b"><span class="section-number-4">2.1.2</span> Classification</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>Predicting results with discrete output<br /></li>
<li>Map input variables to discrete categories<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgad9f7cc" class="outline-3">
<h3 id="orgad9f7cc"><span class="section-number-3">2.2</span> Unsupervised Learning</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Problems with no idea what the results should look like<br /></li>
<li>Derive strucutre from the data by clustering based on relationships among variables in the data<br /></li>
<li>No feedback based on the prediction results<br /></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Oishe Farhan (<a href="mailto:farhanoishe@gmail.com">farhanoishe@gmail.com</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 9.0.9)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
